# PointLoadOnLine

Load in specific point on line

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.point_load_on_line import PointLoadOnLine

# TODO update the JSON string below
json = "{}"
# create an instance of PointLoadOnLine from a JSON string
point_load_on_line_instance = PointLoadOnLine.from_json(json)
# print the JSON string representation of the object
print(PointLoadOnLine.to_json())

# convert the object into a dict
point_load_on_line_dict = point_load_on_line_instance.to_dict()
# create an instance of PointLoadOnLine from a dict
point_load_on_line_from_dict = PointLoadOnLine.from_dict(point_load_on_line_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)